ksekimoto/micropython/ports/rx/rx63n/rx63n_tpu.c
/*
 * Copyright (c) 2018, Kentaro Sekimoto
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 *  -Redistributions of source code must retain the above copyright notice,
 *   this list of conditions and the following disclaimer.
 *  -Redistributions in binary form must reproduce the above copyright notice,
 *   this list of conditions and the following disclaimer in the documentation
 *   and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdio.h>
#include "common.h"
#include "rx63n_tpu.h"

typedef struct st_tpu0 *tpu_reg_t;

#if 0
static tpu_reg_t TPU_REG[] = {
    (tpu_reg_t)0x88108,
    (tpu_reg_t)0x88108,
    (tpu_reg_t)0x8810A,
    (tpu_reg_t)0x8810A,
    (tpu_reg_t)0x8810C,
    (tpu_reg_t)0x8810C,
    (tpu_reg_t)0x88178,
    (tpu_reg_t)0x88178,
    (tpu_reg_t)0x8817A,
    (tpu_reg_t)0x8817A,
    (tpu_reg_t)0x8817C,
    (tpu_reg_t)0x8817C
};
#endif

#define TPU_IPR_VEC(tpu_pin)    (126 + (uint32_t)tpu_pin)
#define TPU_IER_VEC(tpu_pin)    ((126 + (uint32_t)tpu_pin) / 8)

static bool rx_tpu_channel_init_flag[TPU_CHANNEL_SIZE] = {
    false, false, false, false, false, false,
    false, false, false, false, false, false
};

static float rx_tpu_channel_freq[TPU_CHANNEL_SIZE] = {
    TPU_DEFAULT_FREQ,
    TPU_DEFAULT_FREQ,
    TPU_DEFAULT_FREQ,
    TPU_DEFAULT_FREQ,
    TPU_DEFAULT_FREQ,
    TPU_DEFAULT_FREQ,
    TPU_DEFAULT_FREQ,
    TPU_DEFAULT_FREQ,
    TPU_DEFAULT_FREQ,
    TPU_DEFAULT_FREQ,
    TPU_DEFAULT_FREQ,
    TPU_DEFAULT_FREQ
};

static float rx_tpu_channel_duty[TPU_CHANNEL_SIZE] = {
    TPU_DEFAULT_DUTY,
    TPU_DEFAULT_DUTY,
    TPU_DEFAULT_DUTY,
    TPU_DEFAULT_DUTY,
    TPU_DEFAULT_DUTY,
    TPU_DEFAULT_DUTY,
    TPU_DEFAULT_DUTY,
    TPU_DEFAULT_DUTY,
    TPU_DEFAULT_DUTY,
    TPU_DEFAULT_DUTY,
    TPU_DEFAULT_DUTY,
    TPU_DEFAULT_DUTY
};

static uint8_t tpu_pin_channel[] = {
    TIOCA0, 0,
    TIOCB0, 0,
    TIOCC0, 0,
    TIOCD0, 0,
    TIOCA1, 1,
    TIOCB1, 1,
    TIOCA2, 2,
    TIOCB2, 2,
    TIOCA3, 3,
    TIOCB3, 3,
    TIOCC3, 3,
    TIOCD3, 3,
    TIOCA4, 4,
    TIOCB4, 4,
    TIOCA5, 5,
    TIOCB5, 5,
    TIOCA6, 6,
    TIOCB6, 6,
    TIOCC6, 6,
    TIOCD6, 6,
    TIOCA7, 7,
    TIOCB7, 7,
    TIOCA8, 8,
    TIOCB8, 8,
    TIOCA9, 9,
    TIOCB9, 9,
    TIOCC9, 9,
    TIOCD9, 9,
    TIOCA10, 10,
    TIOCB10, 10,
    TIOCA11, 11,
    TIOCB11, 11,
    TPU_END, 0xff
};

static uint8_t pin_tpu_af3[] = {
    P13, TIOCA5,
    P14, TIOCB5,
    P15, TIOCB2,
    P16, TIOCB1,
    P17, TIOCB0,
    P20, TIOCB3,
    P21, TIOCA3,
    P22, TIOCC3,
    P23, TIOCD3,
    P24, TIOCB4,
    P25, TIOCA4,
    P56, TIOCA1,
    P86, TIOCA0,
    P87, TIOCA2,
    PA0, TIOCA0,
    PA1, TIOCB0,
    PA3, TIOCD0,
    PA4, TIOCA1,
    PA5, TIOCB1,
    PA6, TIOCA2,
    PA7, TIOCB2,
    PB0, TIOCA3,
    PB1, TIOCB3,
    PB2, TIOCC3,
    PB3, TIOCD3,
    PB4, TIOCA4,
    PB5, TIOCB4,
    PB6, TIOCA5,
    PB7, TIOCB5,
    PC4, TIOCC6,
    PC5, TIOCD6,
    PC6, TIOCA6,
    PC7, TIOCB6,
    PD0, TIOCA7,
    PD1, TIOCB7,
    PD2, TIOCA8,
    PD3, TIOCB8,
    PE0, TIOCC9,
    PE1, TIOCD9,
    PE2, TIOCA9,
    PE3, TIOCB9,
    PE4, TIOCA10,
    PE5, TIOCB10,
    PE6, TIOCA11,
    PE7, TIOCB11,
    PIN_END, TPU_END
};

/*
 * tpu_pin: enum TPU_CHANNEL_PIN
 */
void rx_tpu_int_ipr(uint8_t tpu_pin, uint8_t priority) {
    int idx = (int)TPU_IPR_VEC(tpu_pin);
    // IPR(TPU5, TGRIA) = priority;
    ICU.IPR[idx].BYTE = priority;
}

/*
 * tpu_pin: enum TPU_CHANNEL_PIN
 */
void rx_tpu_int_ier(uint8_t tpu_pin, int flag) {
    int idx = (int)TPU_IER_VEC(tpu_pin);
    int bit = (6 + (int)tpu_pin) & 7;
    uint8_t mask = (1 << bit);
    ICU.IER[idx].BYTE = (ICU.IER[idx].BYTE & ~mask) | (flag << bit);
}

void rx_tpu_channel_int_enable(uint8_t channel, uint8_t bit) {
    // tpu_reg_t tpu_reg = TPU_REG[channel];
    // tpu_reg->TIER.BYTE |= (1 << bit);
    uint8_t mask = 1 << bit;
    switch (channel) {
        case 0:
            TPU0.TIER.BYTE |= mask;
            break;
        case 1:
            TPU1.TIER.BYTE |= mask;
            break;
        case 2:
            TPU2.TIER.BYTE |= mask;
            break;
        case 3:
            TPU3.TIER.BYTE |= mask;
            break;
        case 4:
            TPU4.TIER.BYTE |= mask;
            break;
        case 5:
            TPU5.TIER.BYTE |= mask;
            break;
        case 6:
            TPU6.TIER.BYTE |= mask;
            break;
        case 7:
            TPU7.TIER.BYTE |= mask;
            break;
        case 8:
            TPU8.TIER.BYTE |= mask;
            break;
        case 9:
            TPU9.TIER.BYTE |= mask;
            break;
        case 10:
            TPU10.TIER.BYTE |= mask;
            break;
        case 11:
            TPU11.TIER.BYTE |= mask;
            break;
    }
}

void rx_tpu_channel_int_disable(uint8_t channel, uint8_t bit) {
    // tpu_reg_t tpu_reg = TPU_REG[channel];
    // tpu_reg->TIER.BYTE &= ~(1 << bit);
    uint8_t mask = 1 << bit;
    switch (channel) {
        case 0:
            TPU0.TIER.BYTE &= ~mask;
            break;
        case 1:
            TPU1.TIER.BYTE &= ~mask;
            break;
        case 2:
            TPU2.TIER.BYTE &= ~mask;
            break;
        case 3:
            TPU3.TIER.BYTE &= ~mask;
            break;
        case 4:
            TPU4.TIER.BYTE &= ~mask;
            break;
        case 5:
            TPU5.TIER.BYTE &= ~mask;
            break;
        case 6:
            TPU6.TIER.BYTE &= ~mask;
            break;
        case 7:
            TPU7.TIER.BYTE &= ~mask;
            break;
        case 8:
            TPU8.TIER.BYTE &= ~mask;
            break;
        case 9:
            TPU9.TIER.BYTE &= ~mask;
            break;
        case 10:
            TPU10.TIER.BYTE &= ~mask;
            break;
        case 11:
            TPU11.TIER.BYTE &= ~mask;
            break;
    }
}

