ksekimoto/micropython/ports/rx/rx63n/rx63n_tpu.c
uint8_t rx_tpu_get_tpu_pin(uint8_t pin_idx) {
    int i = 0;
    uint8_t tpu_pin = TPU_END;
    while (true) {
        if (pin_tpu_af3[i] == PIN_END) {
            break;
        }
        if (pin_tpu_af3[i] == pin_idx) {
            tpu_pin = pin_tpu_af3[i + 1];
            break;
        }
        i += 2;
    }
    return tpu_pin;
}

uint8_t rx_tpu_get_tpu_channel(uint8_t pin_idx) {
    int i = 0;
    uint8_t tpu_channel = 0xff;
    uint8_t tpu_pin = rx_tpu_get_tpu_pin(pin_idx);
    if (tpu_pin == TPU_END) {
        return tpu_channel;
    }
    while (true) {
        if (tpu_pin_channel[i] == TPU_END) {
            break;
        }
        if (tpu_pin_channel[i] == tpu_pin) {
            tpu_channel = tpu_pin_channel[i + 1];
            break;
        }
        i += 2;
    }
    return tpu_channel;
}

/*
 * Prescale: 1                    ticks
 * freq = 1000(1/s) = 1000(us) -> 48000
 * freq = 10000(1/s) = 100(us) -> 4800 <--
 * freq = 100000(1/s) = 10(us) -> 480
 * freq = 1000000(1/s) = 1(us) -> 48
 * Prescale: 4
 * freq = 1000(1/s) = 1000(us) -> 12000 <--
 * freq = 10000(1/s) = 100(us) -> 1200
 * freq = 100000(1/s) = 10(us) -> 120
 * freq = 1000000(1/s) = 1(us) -> 12
 * Prescale: 16
 * freq = 100(1/s) = 10000(us) -> 30000
 * freq = 1000(1/s) = 1000(us) -> 3000 <--
 * freq = 10000(1/s) = 100(us) -> 300
 * freq = 100000(1/s) = 10(us) -> 30
 * freq = 1000000(1/s) = 1(us) -> 3
 * Prescale: 64
 * freq = 1(1/s) = 1000000(us) -> 750000
 * freq = 10(1/s) = 100000(us) -> 75000
 * freq = 100(1/s) = 10000(us) -> 7500 <--
 * freq = 1000(1/s) = 1000(us) -> 750
 * freq = 10000(1/s) = 100(us) -> 75
 * freq = 100000(1/s) = 10(us) -> 7.5
 * freq = 1000000(1/s) = 1(us) -> 0.75
 * Prescale: 256
 * freq = 1(1/s) = 1000000(us) -> 187500
 * freq = 10(1/s) = 100000(us) -> 18750 <--
 * freq = 100(1/s) = 10000(us) -> 1875
 * freq = 1000(1/s) = 1000(us) -> 187.5
 * freq = 10000(1/s) = 100(us) -> 18.75
 * freq = 100000(1/s) = 10(us) -> 1.875
 * freq = 1000000(1/s) = 1(us) -> 0.1875
 */
uint32_t rx_tpu_get_clock_dev(int channel, float freq) {
    uint32_t clkdev;
    if (freq > 10000.0f) {
        clkdev = 1;
    } else if (freq > 1000.0f) {
        clkdev = 4;
    } else if (freq > 100.0f) {
        clkdev = 16;
    } else {
        if ((channel >= 0) && (channel <= 2)) {
            clkdev = 64;
        } else if (freq < 10.0f) {
            clkdev = 1024;
        } else {
            clkdev = 256;
        }
    }
    return clkdev;
}

void rx_tpu_set_clock(int channel, uint32_t clkdev) {
    switch (channel) {
        case 0:
            switch (clkdev) {
                case 1:
                    TPU0.TCR.BIT.TPSC = 0x0;
                    break;
                case 4:
                    TPU0.TCR.BIT.TPSC = 0x1;
                    break;
                case 16:
                    TPU0.TCR.BIT.TPSC = 0x2;
                    break;
                case 64:
                    TPU0.TCR.BIT.TPSC = 0x3;
                    break;
                default:
                    break;
            }
            break;
        case 6:
            switch (clkdev) {
                case 1:
                    TPU6.TCR.BIT.TPSC = 0x0;
                    break;
                case 4:
                    TPU6.TCR.BIT.TPSC = 0x1;
                    break;
                case 16:
                    TPU6.TCR.BIT.TPSC = 0x2;
                    break;
                case 64:
                    TPU6.TCR.BIT.TPSC = 0x3;
                    break;
                default:
                    break;
            }
            break;
        case 1:
            switch (clkdev) {
                case 1:
                    TPU1.TCR.BIT.TPSC = 0x0;
                    break;
                case 4:
                    TPU1.TCR.BIT.TPSC = 0x1;
                    break;
                case 16:
                    TPU1.TCR.BIT.TPSC = 0x2;
                    break;
                case 64:
                    TPU1.TCR.BIT.TPSC = 0x3;
                    break;
                default:
                    break;
            }
            break;
        case 7:
            switch (clkdev) {
                case 1:
                    TPU7.TCR.BIT.TPSC = 0x0;
                    break;
                case 4:
                    TPU7.TCR.BIT.TPSC = 0x1;
                    break;
                case 16:
                    TPU7.TCR.BIT.TPSC = 0x2;
                    break;
                case 64:
                    TPU7.TCR.BIT.TPSC = 0x3;
                    break;
                default:
                    break;
            }
            break;
        case 2:
            switch (clkdev) {
                case 1:
                    TPU2.TCR.BIT.TPSC = 0x0;
                    break;
                case 4:
                    TPU2.TCR.BIT.TPSC = 0x1;
                    break;
                case 16:
                    TPU2.TCR.BIT.TPSC = 0x2;
                    break;
                case 64:
                    TPU2.TCR.BIT.TPSC = 0x3;
                    break;
                default:
                    break;
            }
            break;
        case 8:
            switch (clkdev) {
                case 1:
                    TPU8.TCR.BIT.TPSC = 0x0;
                    break;
                case 4:
                    TPU8.TCR.BIT.TPSC = 0x1;
                    break;
                case 16:
                    TPU8.TCR.BIT.TPSC = 0x2;
                    break;
                case 64:
                    TPU8.TCR.BIT.TPSC = 0x3;
                    break;
                default:
                    break;
            }
            break;
        case 3:
            switch (clkdev) {
                case 1:
                    TPU3.TCR.BIT.TPSC = 0x0;
                    break;
                case 4:
                    TPU3.TCR.BIT.TPSC = 0x1;
                    break;
                case 16:
                    TPU3.TCR.BIT.TPSC = 0x2;
                    break;
                case 64:
                    TPU3.TCR.BIT.TPSC = 0x3;
                    break;
                case 256:
                    TPU3.TCR.BIT.TPSC = 0x6;
                    break;
                case 1024:
                    TPU3.TCR.BIT.TPSC = 0x5;
                    break;
                case 4096:
                    TPU3.TCR.BIT.TPSC = 0x7;
                    break;
                default:
                    break;
            }
            break;
        case 9:
            switch (clkdev) {
                case 1:
                    TPU9.TCR.BIT.TPSC = 0x0;
                    break;
                case 4:
                    TPU9.TCR.BIT.TPSC = 0x1;
                    break;
                case 16:
                    TPU9.TCR.BIT.TPSC = 0x2;
                    break;
                case 64:
                    TPU9.TCR.BIT.TPSC = 0x3;
                    break;
                case 256:
                    TPU9.TCR.BIT.TPSC = 0x6;
                    break;
                case 1024:
                    TPU9.TCR.BIT.TPSC = 0x5;
                    break;
                case 4096:
                    TPU9.TCR.BIT.TPSC = 0x7;
                    break;
                default:
                    break;
            }
            break;
        case 4:
            switch (clkdev) {
                case 1:
                    TPU4.TCR.BIT.TPSC = 0x0;
                    break;
                case 4:
                    TPU4.TCR.BIT.TPSC = 0x1;
                    break;
                case 16:
                    TPU4.TCR.BIT.TPSC = 0x2;
                    break;
                case 64:
                    TPU4.TCR.BIT.TPSC = 0x3;
                    break;
                case 1024:
                    TPU4.TCR.BIT.TPSC = 0x6;
                    break;
            }
            break;
        case 10:
            switch (clkdev) {
                case 1:
                    TPU10.TCR.BIT.TPSC = 0x0;
                    break;
                case 4:
                    TPU10.TCR.BIT.TPSC = 0x1;
                    break;
                case 16:
                    TPU10.TCR.BIT.TPSC = 0x2;
                    break;
                case 64:
                    TPU10.TCR.BIT.TPSC = 0x3;
                    break;
                case 1024:
                    TPU10.TCR.BIT.TPSC = 0x6;
                    break;
            }
            break;
        case 5:
            switch (clkdev) {
                case 1:
                    TPU5.TCR.BIT.TPSC = 0x0;
                    break;
                case 4:
                    TPU5.TCR.BIT.TPSC = 0x1;
                    break;
                case 16:
                    TPU5.TCR.BIT.TPSC = 0x2;
                    break;
                case 64:
                    TPU5.TCR.BIT.TPSC = 0x3;
                    break;
                case 256:
                    TPU5.TCR.BIT.TPSC = 0x6;
                    break;
            }
            break;
        case 11:
            switch (clkdev) {
                case 1:
                    TPU11.TCR.BIT.TPSC = 0x0;
                    break;
                case 4:
                    TPU11.TCR.BIT.TPSC = 0x1;
                    break;
                case 16:
                    TPU11.TCR.BIT.TPSC = 0x2;
                    break;
                case 64:
                    TPU11.TCR.BIT.TPSC = 0x3;
                    break;
                case 256:
                    TPU11.TCR.BIT.TPSC = 0x6;
                    break;
            }
            break;
    }
}

void rx_tpu_channel_enable(int channel) {
    switch (channel) {
        case 0:
        case 1:
        case 2:
        case 3:
        case 4:
        case 5:
            TPUA.TSTR.BYTE |= (1 << channel);   // start counter
            break;
        case 6:
        case 7:
        case 8:
        case 9:
        case 10:
        case 11:
            TPUB.TSTR.BYTE |= (1 << (channel - 6)); // start counter
            break;
        default:
            break;
    }
}

void rx_tpu_channel_disable(int channel) {
    switch (channel) {
        case 0:
        case 1:
        case 2:
        case 3:
        case 4:
        case 5:
            TPUA.TSTR.BYTE &= ~(1 << channel);  // stop counter
            break;
        case 6:
        case 7:
        case 8:
        case 9:
        case 10:
        case 11:
            TPUB.TSTR.BYTE &= ~(1 << (channel - 6)); // stop counter
            break;
        default:
            break;
    }
}

