ksekimoto/micropython/ports/rx/rx63n/rx63n_tpu.c
void rx_tpu_channel_deinit(int channel) {
    rx_tpu_channel_disable(channel);
}

/*
 * Use PWM mode2
 *  one of pin as master of clearing counter
 *                           PINz = TIOCB5 and TIOCB11
 *                           v
 *      +--------+           +--------+
 *      |        |           |        |
 *   ---+        +-----------+        +---
 *      0        TGRx        TGRz
 *               CHx         Chz
 *                           |
 *      +----------+         +----------+
 *      |          |         |          |
 *   ---+          +---------+          +---
 *      0          TGRy      TGRz
 *                 CHy       Chz
 */
void rx_tpu_channel_init(int channel) {
    rx_tpu_channel_disable(channel);
    switch (channel) {
        case 0:
            TPU0.TCR.BIT.CCLR = 0x7; // compare match clear by other counter
            TPU0.TMDR.BIT.MD = 0x3; // PWM mode 2
            TPU0.TIORH.BIT.IOA = 0x5; // compare match high - low
            TPU0.TIORH.BIT.IOB = 0x5; // compare match high - low
            TPU0.TIORL.BIT.IOC = 0x5; // compare match high - low
            TPU0.TIORL.BIT.IOD = 0x5; // compare match high - low
            break;
        case 1:
            TPU1.TCR.BIT.CCLR = 0x7; // compare match clear by other counter
            TPU1.TMDR.BIT.MD = 0x3; // PWM mode 2
            TPU1.TIOR.BIT.IOA = 0x5; // compare match high - low
            TPU1.TIOR.BIT.IOB = 0x5; // compare match high - low
            break;
        case 2:
            TPU2.TCR.BIT.CCLR = 0x7; // compare match clear by other counter
            TPU2.TMDR.BIT.MD = 0x3; // PWM mode 2
            TPU2.TIOR.BIT.IOA = 0x5; // compare match high - low
            TPU2.TIOR.BIT.IOB = 0x5; // compare match high - low
            break;
        case 3:
            TPU3.TCR.BIT.CCLR = 0x7; // compare match clear by other counter
            TPU3.TMDR.BIT.MD = 0x3; // PWM mode 2
            TPU3.TIORH.BIT.IOA = 0x5; // compare match high - low
            TPU3.TIORH.BIT.IOB = 0x5; // compare match high - low
            TPU3.TIORL.BIT.IOC = 0x5; // compare match high - low
            TPU3.TIORL.BIT.IOD = 0x5; // compare match high - low
            break;
        case 4:
            TPU4.TCR.BIT.CCLR = 0x7; // compare match clear by other counter
            TPU4.TMDR.BIT.MD = 0x3; // PWM mode 2
            TPU4.TIOR.BIT.IOA = 0x5; // compare match high - low
            TPU4.TIOR.BIT.IOB = 0x5; // compare match high - low
            break;
        case 5:
            TPU5.TCR.BIT.CCLR = 0x2; // compare match clear by TGRB
            TPU5.TMDR.BIT.MD = 0x3; // PWM mode 2
            TPU5.TIOR.BIT.IOA = 0x5; // compare match high - low
            // TPU5.TIOR.BIT.IOB = 0x6;    // compare match high - high
            break;
        default:
            break;
    }
}

void rx_tpu_set_channel_params(uint8_t pin_idx, int channel, float freq, float duty) {
    uint32_t period_ticks;
    uint32_t duration_ticks;
    uint8_t tpu_pin = rx_tpu_get_tpu_pin(pin_idx);
    uint32_t clkdev = rx_tpu_get_clock_dev(channel, freq);
    rx_tpu_set_clock(channel, clkdev);
    float ticks = ((float)PCLK) / (freq * ((float)clkdev));
    period_ticks = (uint32_t)ticks;
    duration_ticks = (uint32_t)(ticks * duty);
    if ((channel >= 0) && (channel <= 5)) {
        TPU5.TGRB = period_ticks;
        TPU5.TCR.BIT.CCLR = 0x2;    // compare match clear by TGRB
        TPU5.TMDR.BIT.MD = 0x3;     // PWM mode 2
        TPU5.TIOR.BIT.IOB = 0x6;    // compare match high - high
        TPU0.TCNT = 0;
        TPU1.TCNT = 0;
        TPU2.TCNT = 0;
        TPU3.TCNT = 0;
        TPU4.TCNT = 0;
        TPU5.TCNT = 0;
    } else {
        TPU11.TGRB = period_ticks;
        TPU11.TCR.BIT.CCLR = 0x2;   // compare match clear by TGRB
        TPU11.TMDR.BIT.MD = 0x3;    // PWM mode 2
        TPU11.TIOR.BIT.IOB = 0x6;   // compare match high - high
        TPU6.TCNT = 0;
        TPU7.TCNT = 0;
        TPU8.TCNT = 0;
        TPU9.TCNT = 0;
        TPU10.TCNT = 0;
        TPU11.TCNT = 0;
    }
    switch (channel)
    {
        case 0:
            if (tpu_pin == TIOCA0) {
                TPU0.TGRA = duration_ticks;
            } else if (tpu_pin == TIOCB0) {
                TPU0.TGRB = duration_ticks;
            } else if (tpu_pin == TIOCC0) {
                TPU0.TGRC = duration_ticks;
            } else if (tpu_pin == TIOCD0) {
                TPU0.TGRD = duration_ticks;
            }
            break;
        case 1:
            if (tpu_pin == TIOCA1) {
                TPU1.TGRA = duration_ticks;
            } else if (tpu_pin == TIOCB1) {
                TPU1.TGRB = duration_ticks;
            }
            break;
        case 2:
            if (tpu_pin == TIOCA2) {
                TPU2.TGRA = duration_ticks;
            } else if (tpu_pin == TIOCB2) {
                TPU2.TGRB = duration_ticks;
            }
            break;
        case 3:
            if (tpu_pin == TIOCA3) {
                TPU3.TGRA = duration_ticks;
            } else if (tpu_pin == TIOCB3) {
                TPU3.TGRB = duration_ticks;
            } else if (tpu_pin == TIOCC3) {
                TPU3.TGRC = duration_ticks;
            } else if (tpu_pin == TIOCD3) {
                TPU3.TGRD = duration_ticks;
            }
            break;
        case 4:
            if (tpu_pin == TIOCA4) {
                TPU4.TGRA = duration_ticks;
            } else if (tpu_pin == TIOCB4) {
                TPU4.TGRB = duration_ticks;
            }
            break;
        case 5:
            if (tpu_pin == TIOCA5) {
                TPU5.TGRA = duration_ticks;
            }
            break;
        case 6:
            if (tpu_pin == TIOCA6) {
                TPU6.TGRA = duration_ticks;
            } else if (tpu_pin == TIOCB6) {
                TPU6.TGRB = duration_ticks;
            } else if (tpu_pin == TIOCC6) {
                TPU6.TGRC = duration_ticks;
            } else if (tpu_pin == TIOCD6) {
                TPU6.TGRD = duration_ticks;
            }
            break;
        case 7:
            if (tpu_pin == TIOCA7) {
                TPU7.TGRA = duration_ticks;
            } else if (tpu_pin == TIOCB7) {
                TPU7.TGRB = duration_ticks;
            }
            break;
        case 8:
            if (tpu_pin == TIOCA8) {
                TPU8.TGRA = duration_ticks;
            } else if (tpu_pin == TIOCB8) {
                TPU8.TGRB = duration_ticks;
            }
            break;
        case 9:
            if (tpu_pin == TIOCA9) {
                TPU9.TGRA = duration_ticks;
            } else if (tpu_pin == TIOCB9) {
                TPU9.TGRB = duration_ticks;
            } else if (tpu_pin == TIOCC9) {
                TPU9.TGRC = duration_ticks;
            } else if (tpu_pin == TIOCD9) {
                TPU9.TGRD = duration_ticks;
            }
            break;
        case 10:
            if (tpu_pin == TIOCA10) {
                TPU10.TGRA = duration_ticks;
            } else if (tpu_pin == TIOCB10) {
                TPU10.TGRB = duration_ticks;
            }
            break;
        case 11:
            if (tpu_pin == TIOCA11) {
                TPU11.TGRA = duration_ticks;
            }
            break;
        default:
            break;
    }
    #ifdef DEBUG_PWM
    debug_printf("Dt/D/P %04x/%06x/%06x\r\n", (UINT16)duration_ticks, duration, period);
    #endif
    return;
}

void rx_tpu_set_default_freq(float freq) {
    for (int i = 0; i < TPU_CHANNEL_SIZE; i++) {
        rx_tpu_channel_freq[i] = freq;
    }
}

void rx_tpu_set_freq(uint8_t pin_idx, float freq) {
    uint8_t channel = rx_tpu_get_tpu_channel(pin_idx);
    if (channel == TPU_END) {
        return;
    }
    rx_tpu_channel_freq[channel] = freq;
    rx_tpu_set_channel_params(pin_idx, channel, freq, rx_tpu_channel_duty[channel]);
}

float rx_tpu_get_freq(uint8_t pin_idx) {
    uint8_t channel = rx_tpu_get_tpu_channel(pin_idx);
    if (channel == TPU_END) {
        return TPU_DEFAULT_FREQ;
    }
    return rx_tpu_channel_freq[channel];
}

void rx_tpu_set_duty(uint8_t pin_idx, float duty) {
    uint8_t channel = rx_tpu_get_tpu_channel(pin_idx);
    if (channel == TPU_END) {
        return;
    }
    rx_tpu_channel_duty[channel] = duty;
    rx_tpu_set_channel_params(pin_idx, channel, rx_tpu_channel_freq[channel], duty);
}

